import { ContentLinkType } from "components/content";


const serviceDefault = require('../../media/service-default.jpg');
const visualDiagnosis = require('../../media/service-diagnostic.mov');
const grooming = require('../../media/service-grooming.jpg');
const grooming2 = require('../../media/service-grooming2.jpg');
const surgery = require('../../media/service-surgery.jpg');
const animalHospital = require('../../media/service-animal-hospital.jpg');
const animalFood = require('../../media/service-food.jpg');
const laboratory = require('../../media/service-cure.jpg');

export const servicesData: ContentLinkType[] = [
    {
      name: 'Загальне',
      description:
        'Наша клініка надає повний спектр хірургічних послуг, включаючи загальні операції та ортопедичні втручання. Ми використовуємо сучасне обладнання, безпечну анестезію, включаючи інгаляційну. Ми забезпечуємо професійний підхід на всіх етапах — від діагностики до реабілітації. ',
      lists: [
        {header: 'Наші хірургічні послуги:', items: ['Планові та екстрені операції (стерилізація, кастрація, видалення новоутворень)','Хірургія внутрішніх органів (операції на шлунково-кишковому тракті, сечовидільній системі тощо)',  'Лікування травм та ран (ушивання, пластика тканин, реконструктивні операції)', 'Корекція завороту повік, корекція брахіоцефалічного синдрому(ринопластика, палатопластика).']},
        {header: 'Ортопедичні операції:', items: ['Репозиція та фіксація переломів','Остеосинтез (встановлення пластин, гвинтів, спиць)',  'Лікування вивихів та розривів зв’язок', 'Корекція вроджених і набутих деформацій.']}
      ],
      images: [serviceDefault],
    },
    {
      name: 'Терапія',
      description:
        'Наша ветеринарна клініка пропонує комплексну терапевтичну допомогу для ваших улюбленців. Ми займаємося діагностикою, лікуванням та профілактикою різних захворювань у тварин. Наші ветеринарні лікарі використовують сучасні методи терапії, безпечні медикаменти та індивідуальний підхід до кожного пацієнта.',
      lists: [
        {
          header: 'Основні напрямки терапії:',
          items: [
            'Лікування інфекційних та хронічних захворювань',
            'Корекція травних розладів',
            'Терапія алергічних реакцій',
            'Лікування захворювань серцево-судинної та дихальної систем',
            'Відновлення після операцій та травм',
            'Вакцинації (щеплення) відповідно до міжнародних ветеринарних стандартів'
          ]
        }
      ],
      images: [serviceDefault],
    },
    {
      name: 'Хірургія',
      description: 'Опис для Хірургії.',
      lists: [],
      images: [surgery],
    },
    {
      name: 'Візуальна діагностика',
      description:
        'Сучасні методи візуальної діагностики дозволяють швидко та точно оцінити стан внутрішніх органів, виявити патології та встановити правильний діагноз. У нашій клініці використовується сучасне обладнання, що гарантує безпеку та комфорт для вашого улюбленця.',
      lists: [
        {
          header: 'Наші послуги з візуальної діагностики:',
          items: [
            'УЗД (ультразвукове дослідження) – діагностика органів черевної порожнини, серця, репродуктивної системи, виявлення патологій та новоутворень',
            'Рентгенографія – дослідження кісток, суглобів, грудної та черевної порожнини, діагностика травм, артритів, дисплазій',
            'Ехокардіографія (ЕхоКГ) – ультразвукове дослідження серця для виявлення захворювань серцево-судинної системи.'
          ]
        }
      ],
      images: [visualDiagnosis],
    },
    {
      name: 'Лабораторні дослідження',
      description:
        'Точна діагностика – запорука успішного лікування. У нашій клініці проводяться сучасні лабораторні дослідження, які допомагають швидко виявити захворювання та призначити ефективне лікування.',
      lists: [
        {
          header: 'Наші лабораторні послуги:',
          items: [
            'Загальний та біохімічний аналіз крові – оцінка стану організму, виявлення запалень, анемії, порушень роботи внутрішніх органів',
            'Аналіз сечі – діагностика захворювань нирок, сечовивідної системи, метаболічних порушень',
            'Цитологічні дослідження – аналіз клітин шкіри, пухлин, виділень для виявлення патологічних змін',
            'Мікроскопія зішкрібів – діагностика грибкових та паразитарних захворювань шкіри',
            'Бактеріологічний посів – виявлення бактеріальних інфекцій та визначення чутливості до антибіотиків',
            'Дослідження калу – виявлення паразитів, порушень травлення, дисбактеріозу',
            'Експрес-тести – швидка діагностика інфекційних захворювань'
          ]
        }
      ],
      images: [laboratory],
    },
    {
      name: 'Корми',
      description: 'У нашій ветеринарній аптеці ви знайдете широкий вибір якісних кормів для собак, котів:Royal Canin, Purina Pro Plan, Josera, Brekkies, Optimeal, Club 4 Paws, Savory, Hill’s, Bavaro, Brit, Friskies, Мяу, Schesir, а також Karmen, Природа, Lo-Lo для гризунів. Подбайте про здоров’я свого улюбленця разом із нами!',
      lists: [],
      images: [animalFood],
    },
    {
      name: 'Аптека',
      description:
        'У нашій ветеринарній аптеці ви знайдете все необхідне для здоров’я та комфорту вашого улюбленця! Також у нас є наповнювачі для котів і гризунів, смаколики, іграшки, нашийники та рулетки. Завітайте та подбайте про свого улюбленця разом із нами!',
      lists: [
        {
          header: 'Асортимент аптеки:',
          items: [
            'Засоби від бліх і кліщів: Bravecto, Simparica, NexGard, Credelio, Stronghold Plus, Frontline, Advocate, Advantix.',
            'Препарати від гельмінтів: Drontal, Milpro, Milprazon, Caniquantel, Procox, Wormikil.',
            'Вітаміни: 8 in 1 та інші.',
            'Догляд за зубами: Dentisept, Orozyme.',
            'Пробіотики: FortiFlora.',
            'Лосьйони для вух: Auricap, Skinotic та інші.',
            'Очні краплі та широкий вибір шампунів.'
          ]
        }
      ],
      images: [serviceDefault],
    },
    {
      name: 'Стаціонар для тварин',
      description: 'Опис для стаціонару для тварин.',
      lists: [],
      images: [animalHospital],
    },
    {
      name: 'Грумінг',
      description: 'У нашій ветеринарній клініці доступний широкий спектр послуг для здоров’я та догляду за вашими улюбленцями, зокрема професійний грумінг. Ми подбаємо про чистоту, здоров’я шерсті та шкіри вашого улюбленця, пропонуючи стрижку, купання, тримінг, чистку вух і очей, підстригання кігтів та інші процедури.',
      lists: [],
      images: [grooming, grooming2],
    },
  ];